Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4CMS16C_0.xml
          </instance>
          <instance name="SMC1">
            <register-group address-space="base" name="SMC1" name-in-module="SMC" offset="0x4801C000"/>
          </instance>
        </module>
        <module name="SPI" version="6088W">
          <instance name="SPI0">
            <register-group address-space="base" name="SPI0" name-in-module="SPI" offset="0x40008000"/>
            <signals>
              <signal pad="PA6" function="A" group="SPI0_MISO"/>
              <signal pad="PA7" function="A" group="SPI0_MOSI"/>
              <signal pad="PA5" function="A" group="SPI0_NPCS" index="0"/>
              <signal pad="PA21" function="A" group="SPI0_NPCS" index="1"/>
              <signal pad="PA22" function="A" group="SPI0_NPCS" index="2"/>
              <signal pad="PA23" function="A" group="SPI0_NPCS" index="3"/>
              <signal pad="PA8" function="A" group="SPI0_SPCK"/>
            </signals>
          </instance>
          <instance name="SPI1">
            <register-group address-space="base" name="SPI1" name-in-module="SPI" offset="0x48000000"/>
            <signals>
              <signal pad="PC3" function="A" group="SPI1_MISO"/>
              <signal pad="PC4" function="A" group="SPI1_MOSI"/>
              <signal pad="PC2" function="A" group="SPI1_NPCS" index="0"/>
              <signal pad="PC8" function="B" group="SPI1_NPCS" index="3"/>
              <signal pad="PC5" function="A" group="SPI1_SPCK"/>
            </signals>
          </instance>
        </module>
        <module name="SUPC" version="11249A">
          <instance name="SUPC">
            <register-group address-space="base" name="SUPC" name-in-module="SUPC" offset="0x400E1410"/>
          </instance>
        </module>
        <module name="TC" version="6082U">
          <instance name="TC0">
            <register-group address-space="base" name="TC0" name-in-module="TC" offset="0x40010000"/>
            <signals>
              <signal pad="PB4" function="B" group="TCLK" index="0"/>
              <signal pad="PB9" function="A" group="TCLK" index="1"/>
              <signal pad="PB12" function="A" group="TCLK" index="2"/>
              <signal pad="PA13" function="B" group="TIOA" index="0"/>
              <signal pad="PB7" function="A" group="TIOA" index="1"/>
              <signal pad="PB10" function="A" group="TIOA" index="2"/>
              <signal pad="PA14" function="B" group="TIOB" index="0"/>
              <signal pad="PB8" function="A" group="TIOB" index="1"/>
              <signal pad="PB11" function="A" group="TIOB" index="2"/>
            </signals>
          </instance>
          <instance name="TC1">
            <register-group address-space="base" name="TC1" name-in-module="TC" offset="0x40014000"/>
            <signals>
              <signal pad="PA17" function="B" group="TCLK" index="4"/>
              <signal pad="PA19" function="B" group="TCLK" index="5"/>
              <signal pad="PA15" function="B" group="TIOA" index="4"/>
              <signal pad="PA18" function="B" group="TIOA" index="5"/>
              <signal pad="PA16" function="B" group="TIOB" index="4"/>
              <signal pad="PA20" function="B" group="TIOB" index="5"/>
            </signals>
          </instance>
        </module>
        <module name="TRNG" version="6334E">
          <instance name="TRNG">
            <register-group address-space="base" name="TRNG" name-in-module="TRNG" offset="0x40048000"/>
          </instance>
        </module>
        <module name="TWI" version="6212Q">
          <instance name="TWI0">
            <register-group address-space="base" name="TWI0" name-in-module="TWI" offset="0x40018000"/>
            <signals>
              <signal pad="PA25" function="A" group="TWCK" index="0"/>
              <signal pad="PA24" function="A" group="TWD" index="0"/>
            </signals>
          </instance>
          <instance name="TWI1">
            <register-group address-space="base" name="TWI1" name-in-module="TWI" offset="0x4001C000"/>
            <signals>
              <signal pad="PB1" function="A" group="TWCK" index="1"/>
              <signal pad="PB0" function="A" group="TWD" index="1"/>
            </signals>
          </instance>
        </module>
        <module name="UART" version="6418I">
          <instance name="UART0">
            <register-group address-space="base" name="UART0" name-in-module="UART" offset="0x400E0600"/>
            <signals>
              <signal pad="PB4" function="A" group="URXD" index="0"/>
              <signal pad="PB5" function="A" group="UTXD" index="0"/>
            </signals>
          </instance>
          <instance name="UART1">
            <register-group address-space="base" name="UART1" name-in-module="UART" offset="0x48004000"/>
            <signals>
              <signal pad="PC1" function="A" group="URXD" index="1"/>
              <signal pad="PC0" function="A" group="UTXD" index="1"/>
            </signals>
          </instance>
        </module>
        <module name="USART" version="6089ZD">
          <instance name="USART0">
            <register-group address-space="base" name="USART0" name-in-module="USART" offset="0x40024000"/>
            <signals>
              <signal pad="PA20" function="A" group="CTS" index="0"/>
              <signal pad="PA19" function="A" group="RTS" index="0"/>
              <signal pad="PB16" function="A" group="RXD" index="0"/>
              <signal pad="PB18" function="A" group="SCK" index="0"/>
              <signal pad="PB17" function="A" group="TXD" index="0"/>
            </signals>
          </instance>
          <instance name="USART1">
            <register-group address-space="base" name="USART1" name-in-module="USART" offset="0x40028000"/>
            <signals>
              <signal pad="PA18" function="A" group="CTS" index="1"/>
              <signal pad="PA17" function="A" group="RTS" index="1"/>
              <signal pad="PA11" function="A" group="RXD" index="1"/>
              <signal pad="PA16" function="A" group="SCK" index="1"/>
              <signal pad="PA12" function="A" group="TXD" index="1"/>
            </signals>
          </instance>
          <instance name="USART2">
            <register-group address-space="base" name="USART2" name-in-module="USART" offset="0x4002C000"/>
            <signals>
              <signal pad="PA15" function="A" group="CTS" index="2"/>
              <signal pad="PA14" function="A" group="RTS" index="2"/>
              <signal pad="PA9" function="A" group="RXD" index="2"/>
              <signal pad="PA13" function="A" group="SCK" index="2"/>
              <signal pad="PA10" function="A" group="TXD" index="2"/>
            </signals>
          </instance>
          <instance name="USART3">
            <register-group address-space="base" name="USART3" name-in-module="USART" offset="0x40030000"/>
            <signals>
              <signal pad="PA1" function="A" group="CTS" index="3"/>
              <signal pad="PA0" function="A" group="RTS" index="3"/>
              <signal pad="PA3" function="A" group="RXD" index="3"/>
              <signal pad="PA2" function="A" group="SCK" index="3"/>
              <signal pad="PA4" function="A" group="TXD" index="3"/>
            </signals>
          </instance>
        </module>
        <module name="WDT" version="6080F">
          <instance name="WDT">
            <register-group address-space="base" name="WDT" name-in-module="WDT" offset="0x400E1450"/>
